cases/bubblePipe/constant/momentumTransport.air
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport.air;
}

simulationType  laminar;
