cases/bubblePipe/constant/momentumTransport.water
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport.water;
}

simulationType  RAS;

RAS
{
    model    kOmegaSSTSato;

    turbulence      on;
    printCoeffs     on;
}
