cases/bubblePipe/constant/phaseProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}

type    basicPolyPhaseSystem;

phases (air water);

air
{
    type            pureIsothermalPolyPhaseModel;

    diameterModel   threeMomentLogNormal;

    threeMomentLogNormalCoeffs
    {
        dMax            1e-1;
        dMin            1e-4;

        p               3;
        q               2;

        continuousPhase water;

        coalescence
        {
            active                  true;

            efficiencyType          constant;
            frequencyType           LehrMilliesMewes;

            constantCoaEffCoeffs
            {
                K                       1;
            }

            LehrMilliesMewesCoaFreqCoeffs
            {
                turbulentCoalescence    true;
                buoyantCoalescence      true;
                laminarCoalescence      false;
            }

            GaussHermite            5;
        }

        breakup
        {
            active          true;
            type            LehrMilliesMewes;

            LehrMilliesMewesBreakCoeffs
            {
                sigma           0.07197;
            }

            GaussHermite    5;
            GaussLegendre   5;
        }
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;

    diameterModel   constant;

    constantCoeffs
    {
        d           1e-4;
    }

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            linear;
        minFullyContinuousAlpha.air 0.7;
        minPartlyContinuousAlpha.air 0.3;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.3;
    }

    drag
    {
        type            linear;
        minFullyContinuousAlpha.air 0.7;
        minPartlyContinuousAlpha.air 0.5;
        minFullyContinuousAlpha.water 0.7;
        minPartlyContinuousAlpha.water 0.5;
    }

    polyDrag
    {
        $drag;
    }
}

surfaceTension
{
    air_water
    {
        type    constant;
        sigma   0.07197;
    }
}

interfaceCompression
{}

drag
{
    air_dispersedIn_water
    {
        type            LogMoM;
        mode            quadrature;
        GaussHermite    5;

        drag
        {
            type            IshiiZuber;
            residualRe      1e-3;
        }
    }

    water_dispersedIn_air
    {
        type            SchillerNaumann;
        residualRe      1e-3;
    }

    air_segregatedWith_water
    {
        type    segregated;
        m       0.5;
        n       8;
    }
}

virtualMass
{
    air_dispersedIn_water
    {
        type            constantCoefficient;
        Cvm             0.5;
    }

    water_dispersedIn_air
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
}

heatTransfer
{}

phaseTransfer
{}

lift
{
    air_dispersedIn_water
    {
        type    LogMoM;
        mode    diameter;
        p       (2 0.33333);
        q       (2 0);

        lift
        {
            type    Tomiyama;

            aspectRatio
            {
                type    Wellek;
            }
        }

        wallDamping
        {
            type                 cosine;
            Cd                   1;
            zeroInNearWallCells  true;
        }
    }

    water_dispersedIn_air
    {
        type    none;
    }
}

wallLubrication
{}

turbulentDispersion
{
    air_dispersedIn_water
    {
        type            LogMoM;
        mode            quadrature;
        GaussHermite    5;

        turbulentDispersion
        {
            type    Burns;
            sigma   1;
        }
    }

    water_dispersedIn_air
    {
        type    none;
    }
}
