cases/bubblePipe/0.org/U.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.water;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 1.6);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            mapped;
        field           U.water;
        setAverage      yes;
        average         (0 0 1.6);
        interpolationScheme cell;
        value           $internalField;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.water;
        value           $internalField;
    }

    walls
    {
        type            noSlip;
    }
}
