cases/bubblePipe/0.org/U2.air
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U2.air;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            mapped;
        field           U2.air;
        setAverage      no;
        average         (0 0 0);
        interpolationScheme cell;
        value           $internalField;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi2.air;
        value           $internalField;
    }

    walls
    {
        type            slip;
    }
}
