cases/bubblePipe/0.org/k.water
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k.water;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            mapped;
        field           k.water;
        setAverage      no;
        average         0;
        interpolationScheme cell;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}
