cases/bubblePipe/0.org/nut.water
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut.water;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    walls
    {
        type            nutkWallFunction;
        value           $internalField;
    }
}
