cases/bubblePipe/0.org/omega.water
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega.water;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            mapped;
        field           omega.water;
        setAverage      no;
        average         0;
        interpolationScheme cell;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}
