cases/bubblePipe/system/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains  4;

method              simple;

simpleCoeffs
{
    n               (1 1 4);
}
